# Создать функцию которая принимает 2 массива и выдает массив первый элемент которого равен сумме
# первого элемента первого массива и последнего элемента второго массива
# второй - сумма второго элемента первого массива и предпоследнего элемента второго массива

# 4. Функция принимает массив массивов [[1,2,3], [11,22,33], [111,222,333,444], [5,5,3,2], [3]].
# Надо
# а. Выдать сумму всех чисел
# б. Выдать все в одном массиве: [1,2,3,1,2,3,1,2,3,4,5,5,3,2,3]
# в. Выдать массив, массивов, где первый - это все элементы под индексом 0, второй - все элементы под индексом 1, и так далее. Например: [[1,11,111,5,3],[2,22,222,5,None],...]