# Напиши функцию которая принимает два массива и выдает "массив различий" - индекс по которому элементы не равны, значение из первого и значение из второго
# Например [1,100,3] [1,200,3] должно выдавать: индекс:1, значение в первом: 100, значение во втором, 200
# Отдельно проверь случай: [True, 2, 3] и [1,2,3]. Это должно выдавать "разные"


# Напиши функцию, которая принимает два словаря (в том числе с вложенными словарями) и выдает различия. Так например
# {1: {2: 3}} и {1: {2: 4}} должно выдавать: ключ: '1.2', значение1: 3, значение2: 4
# Для простоты исходим из того, значениям могут быть только словари или примитивы


# Напиши функцию, которая принимает два словаря (в том числе со вложенными словарями и массивами) и выдает различия
# Так например: {1: {2: [3,4]}} и {1: {2: [3,400]}} должно выдавать ключ "1.2[2]", значение1: 4, значение2: 400



