a = ['alex', 'bob', 'john']
b = ['alice', 'bob', 'anna']
# 1. написать функцию, которая принимает несколько массивов с именами, надо объеденить их в один, но выдать только уникальные имена
# попробуй это сделать через СЕТ (это должно быть мега-просто) и без использования СЕТ (достаточно типичная задача)
res1 = ['alex', 'bob', 'john', 'alice', 'anna'] # порядок не важен

# 2. написать функцию, которая принимает несколько массивов и выдает массив только из пересекающихся элементов
res2 = ['bob'] # порядок не важен

